Процедура ВыполнитьПеренос() Экспорт

    ВыборкаКвартир = Справочники.Квартиры.Выбрать();
    
    Пока ВыборкаКвартир.Следующий() Цикл
        
        Кв = ВыборкаКвартир.Ссылка;
        
        Для каждого Стр Из Кв.ПриборыУчета Цикл
            
            НовыйПрибор = Справочники.ПриборыУчета.СоздатьЭлемент();
            
            // Наименование для удобства
            НовыйПрибор.Наименование = "Прибор кв. " 
                + Кв.Наименование 
                + ", строка " 
                + Формат(Стр.НомерСтроки, "ЧГ=0");
            
            // Привязка к объекту учета - к квартире
            НовыйПрибор.ОбъектУчета = Кв;
            
            НовыйПрибор.ДатаПроизводства      = Стр.ДатаПроизводства;
            НовыйПрибор.ДатаУстановки        = Стр.ДатаУстановки;
            НовыйПрибор.ДатаПоследнейПоверки = Стр.ДатаПоследнейПоверки;
            
            // Переводим дату интервала в количество лет
            Если ЗначениеЗаполнено(Стр.МежповерочныйИнтервалГод) Тогда
                НовыйПрибор.МежповерочныйИнтервалЛет =
                    Год(Стр.МежповерочныйИнтервалГод)
                    - Год(НачалоГода(Стр.МежповерочныйИнтервалГод));
            КонецЕсли;
            
            НовыйПрибор.Записать();
            
        КонецЦикла;
        
    КонецЦикла;
    
    Сообщить("Перенос приборов из квартир завершен.");

КонецПроцедуры
