
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПоказанияПриборовУчета
	Движения.ПоказанияПриборовУчета.Записывать = Истина;
	Для Каждого ТекСтрокаТабЧасть Из ТабЧасть Цикл
		Движение = Движения.ПоказанияПриборовУчета.Добавить();
		Движение.ПриборУчета = ТекСтрокаТабЧасть.ПриборУчета;
		Движение.ДатаПоказания = ТекСтрокаТабЧасть.ДатаПоказаний;
		Движение.НачальныеПоказания = ТекСтрокаТабЧасть.НачальныеПоказания;
		Движение.КонечныеПоказания = ТекСтрокаТабЧасть.КонечныеПоказания;
	КонецЦикла;

	// регистр ИсторияИзмененийПоказаний
	Движения.ИсторияИзмененийПоказаний.Записывать = Истина;
	Для Каждого ТекСтрокаТабЧасть Из ТабЧасть Цикл
		Движение = Движения.ИсторияИзмененийПоказаний.Добавить();
		Движение.ДатаИзменения = Дата;
		Движение.ПриборУчета = ТекСтрокаТабЧасть.ПриборУчета;
		Движение.СтароеЗначение = ТекСтрокаТабЧасть.НачальныеПоказания;
		Движение.НовоеЗначение = ТекСтрокаТабЧасть.КонечныеПоказания;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
