

&НаСервере
Процедура ЗаписатьНаСервере()
	НоваяЗапись = РегистрыСведений.ВызовыСлесарю.СоздатьНаборЗаписей();
	//НоваяЗапись.Дом = Дом;
	НоваяЗапись.Квартира = Квартира;
	НоваяЗапись.Телефон = Телефон;
	НоваяЗапись.Причина = Причина;
	НоваяЗапись.ДатаВызова = Дата;
	НоваяЗапись.ВремяВызова = Время;

    НоваяЗапись.Записать();
    Сообщить("Запись успешно сохранена");
   
КонецПроцедуры


&НаКлиенте
Процедура Записать(Команда)
	Попытка
        ЗаписатьНаСервере();
    Исключение
        Сообщить(ОписаниеОшибки());
        Возврат;
	КонецПопытки;
КонецПроцедуры

