
&НаКлиенте
Процедура ТабЧасть2УслугаПриИзменении(Элемент)
	
	СтрТабЧасти = Элементы.ТабЧасть2.ТекущиеДанные;
	Если СтрТабЧасти.Услуга <> Неопределено Тогда 
		СтрТабЧасти.Цена = ОтборТарифа(СтрТабЧасти.Услуга);
	КонецЕсли;
	
КонецПроцедуры     
	
	&НаКлиенте
Процедура ТабЧасть2КоличествоПриИзменении(Элемент)
	
	СтрТабЧасти = Элементы.ТабЧасть2.ТекущиеДанные;
    СтрТабЧасти.Сумма = СтрТабЧасти.Количество * СтрТабЧасти.Цена;
	КонецПроцедуры

&НаСервере
функция ОтборТарифа(Услуга)
		Если Услуга = Неопределено Тогда
        Возврат 0;
	КонецЕсли;
	Запрос = Новый Запрос;
        Запрос.Текст =
		  "ВЫБРАТЬ
		  |	ТарифыЖКХ.ЦенаЗаЕдиницу КАК ЦенаЗаЕдиницу
		  |ИЗ
		  |	Справочник.ТарифыЖКХ КАК ТарифыЖКХ
		  |ГДЕ
		  |	ТарифыЖКХ.НаименованиеУслуги = &Услуга";
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ЦенаЗаЕдиницу;
    КонецЕсли;
    
    Возврат 0;	
КонецФункции
