
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВызовыСлесарю
	Движения.ВызовыСлесарю.Записывать = Истина;
	Для Каждого ТекСтрокаТабЧасть2 Из ТабЧасть2 Цикл
		Движение = Движения.ВызовыСлесарю.Добавить();
		Движение.Цена = ТекСтрокаТабЧасть2.Цена;
		Движение.Сумма = ТекСтрокаТабЧасть2.Сумма;
		Движение.Услуга = ТекСтрокаТабЧасть2.Услуга;
		Движение.Дом = Дом;
		Движение.Слесарь = Слесарь;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
